       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO IS INITIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAME PIC X(7) VALUE 'DevFest'.
       PROCEDURE DIVISION.
       BEGIN.
           CALL 'GREET' USING NAME END-CALL.
           STOP RUN.
       END PROGRAM HELLO.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GREET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(32).
       LINKAGE SECTION.
       01 NAME PIC X(32).
       PROCEDURE DIVISION USING NAME.
       BEGIN.
           DISPLAY 'Hello ' NAME END-DISPLAY.
           GOBACK.
       END PROGRAM GREET.
